org/main/20220430172003-emacs_lisp.org
:PROPERTIES:
:ID:       2677F2BC-EB38-47D1-90FC-59943B97B870
:END:
#+title: emacs-lisp
#+HUGO_SECTION:main
#+filetags: :draft:

* declar/assign symbols
** function
** variable
*** local
**** let*: sequential let
**** let: concurrent let
* tags table
generated by the ~etags~ program, and is used by ~xref~ functions
* open file

* with Org-mode
** create entry in org-mode
insert heading.
** navigate in org-mode file
#+begin_src emacs-lisp
  (require 'org-ml)
  (defun testfunc ()
     (interactive)
     (setq x (org-ml-parse-subtrees 'all)))
   (global-set-key (kbd "C-c t") 'testfunc)
   (print x)
#+end_src
** get time
#+begin_src emacs-lisp
  (org-insert-time-stamp (org-current-time))<2022-04-30 Sat>
  (insert-before-markers (format-time-string "%Y" (org-current-time))) 2022
  (insert "hyt")
  (org-time-convert-to-integer (org-current-time))
  
#+end_src
** using org-ml library
*** getting things at point
org-ml functions with =this= often deal with things at point
+ org-ml-parse-this-[object|item|buffer|element|section|subtree|headline]
*** filtering 
* editing
** language-server-like
company mode is enough.
* File I/O
** Read(load)
#+begin_src emacs-lisp
  (with-temp-buffer
    (insert-file-contents file-path)
    (setq data-variable (read (current-buffer))))
#+end_src
** Save
#+begin_src emacs-lisp
  (with-temp-file file-path
      (print output (current-buffer)))
#+end_src
* plist and alist
** plist
** alist
*** searching
alist-get
*** modification
it's little tricky because there's no built in method for this.
So we use ~push~
#+begin_src emacs-lisp
  (push '(key . val) alist)
#+end_src
* TODO How hooks work?
