content/posts/20220430172003-emacs_lisp.md
+++
title = "emacs-lisp"
author = ["Linfeng  He"]
draft = false
+++

## declar/assign symbols {#declar-assign-symbols}


### function {#function}


### variable {#variable}


#### local {#local}

<!--list-separator-->

-  let\*: sequential let

<!--list-separator-->

-  let: concurrent let


## tags table {#tags-table}

generated by the `etags` program, and is used by `xref` functions


## open file {#open-file}


## with Org-mode {#with-org-mode}


### create entry in org-mode {#create-entry-in-org-mode}

insert heading.


### navigate in org-mode file {#navigate-in-org-mode-file}

```emacs-lisp
(require 'org-ml)
(defun testfunc ()
   (interactive)
   (setq x (org-ml-parse-subtrees 'all)))
 (global-set-key (kbd "C-c t") 'testfunc)
 (print x)
```


### get time {#get-time}

```emacs-lisp
(org-insert-time-stamp (org-current-time))<2022-04-30 Sat>
(insert-before-markers (format-time-string "%Y" (org-current-time))) 2022
(insert "hyt")
(org-time-convert-to-integer (org-current-time))

```


### using org-ml library {#using-org-ml-library}


#### getting things at point {#getting-things-at-point}

org-ml functions with `this` often deal with things at point

-   org-ml-parse-this-[object|item|buffer|element|section|subtree|headline]


#### filtering {#filtering}


## editing {#editing}


### language-server-like {#language-server-like}

company mode is enough.


## File I/O {#file-i-o}


### Read(load) {#read--load}

```emacs-lisp
(with-temp-buffer
  (insert-file-contents file-path)
  (setq data-variable (read (current-buffer))))
```


### Save {#save}

```emacs-lisp
(with-temp-file file-path
    (print output (current-buffer)))
```


## plist and alist {#plist-and-alist}


### plist {#plist}


### alist {#alist}


#### searching {#searching}

alist-get


#### modification {#modification}

it's little tricky because there's no built in method for this.
So we use `push`

```emacs-lisp
(push '(key . val) alist)
```


## test [Note-taking]({{< relref "20220508095438-note_taking.md" >}}) {#test-note-taking--20220508095438-note-taking-dot-md}
